#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x3BC (0x654 - 0x298)
// BlueprintGeneratedClass B_BackgroundProceduralBuilding.B_BackgroundProceduralBuilding_C
class AB_BackgroundProceduralBuilding_C : public AActor
{
public:
	class USplineComponent*                      Spline;                                            // 0x298(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*              Building;                                          // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProceduralMeshComponent*              TempProceduralBuilding;                            // 0x2B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        Snap_Grid_;                                        // 0x2B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Snap_Mesh_Spline;                                  // 0x2BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B4A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                TempTris;                                          // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       TempMeshVertices;                                  // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                               TempDistanceBtwPoints;                             // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                     TempUV;                                            // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        TempNumberCurvePoints;                             // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Button_Snap_Object_in_World;                       // 0x304(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Apply_Presets_Button;                              // 0x305(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Only_One_Type_Presets;                             // 0x306(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Random_Button;                                     // 0x307(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Border_Type_On_UV;                                 // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Roof_On;                                           // 0x30C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B4E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Roof_Border_Type_Material;                         // 0x310(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B4F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInstance*>             Top_Roof_Materials;                                // 0x318(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstance*                     TopRoofMaterial;                                   // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        Border_Variation;                                  // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B51[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInstance*>             BorderMaterials;                                   // 0x338(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstance*>             TempBorderMaterial;                                // 0x348(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstance*>             Roof_Materials;                                    // 0x358(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        Roof_Type_Material_;                               // 0x368(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B54[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     RoofMaterial;                                      // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         MaterialFound;                                     // 0x378(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B57[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     TempMaterial;                                      // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>             Ground_Floor_Materials;                            // 0x388(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInstance*                     GroundFloorMaterial;                               // 0x398(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInstance*>             Facades_Materials;                                 // 0x3A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                ArrayNumberHorizontal_GF_Windows;                  // 0x3B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMaterialInstance*>             TempFacadesMaterial;                               // 0x3C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                ArrayNumberHorizontalWindows;                      // 0x3D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        Overwrite_GroundFloor_X_Windows;                   // 0x3E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B5A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     Overwrite_GroundFloor_Material;                    // 0x3E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                Overwrite_X_Windows;                               // 0x3F0(0x10)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>             Overwrite_Facade_Material;                         // 0x400(0x10)(Edit, BlueprintVisible)
	TArray<class UMaterialInstance*>             Overwrite_Border__Material;                        // 0x410(0x10)(Edit, BlueprintVisible)
	class UMaterialInstance*                     Overwrite_Roof_Material;                           // 0x420(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstance*                     Overwrite_Roof_Top_Material;                       // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       RoofMeshVerticesPrimary;                           // 0x430(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       RoofBackMeshVertices;                              // 0x440(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       RoofTopMeshVertices;                               // 0x450(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       RoofMeshVertices;                                  // 0x460(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                     RoofTopUV;                                         // 0x470(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                     RoofUV;                                            // 0x480(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector2D>                     RoofBackUV;                                        // 0x490(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                Array_GF_Height;                                   // 0x4A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        RealGroundFloorHeight;                             // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentHeight;                                     // 0x4B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        X_Windows;                                         // 0x4B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B68[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       TempDistanceUV;                                    // 0x4C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Border_Roof_Height;                                // 0x4C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SecondAngle;                                       // 0x4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FirstAngle;                                        // 0x4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FinalAngle;                                        // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Border_Roof_Width;                                 // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RealHeight;                                        // 0x4EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempVerticesRoofMissed;                            // 0x4F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B6D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       RoofMeshVerticesCurves;                            // 0x4F8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       TempDistanceSegmentation;                          // 0x508(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CurrentSectionNumber;                              // 0x510(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B70[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       TempCurrentDistance;                               // 0x518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TempCurveDivisionOfTexture;                        // 0x520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempCurrentSegment;                                // 0x528(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempNumberOfSegments;                              // 0x52C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SignPlusOrMinus;                                   // 0x530(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B73[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       HeightOffsetUV;                                    // 0x538(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Debug;                                             // 0x540(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B75[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       TopOffsetUV;                                       // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LateralOffsetUV;                                   // 0x550(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<int32>                                RoofTris;                                          // 0x558(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               TempLastDirection;                                 // 0x568(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               TempCurrentDirection;                              // 0x580(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               LastLocationPosition;                              // 0x598(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempForTris;                                       // 0x5B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B77[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FProcMeshTangent>              TempTangents;                                      // 0x5B8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FVector>                       TempNormals;                                       // 0x5C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        CurrentSectionFinalBuilding;                       // 0x5D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_GroundSection                     Section_Ground_Floor;                              // 0x5DC(0x10)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B79[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FST_Section>                   Sections_Floors;                                   // 0x5F0(0x10)(Edit, BlueprintVisible)
	int32                                        TempCurrentIndex;                                  // 0x600(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_VerticesForRoof;                              // 0x604(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B7C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FST_PresetsBuilding>           Presets;                                           // 0x608(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        Temp_Integer;                                      // 0x618(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FST_RandomOptions                     Random_Options;                                    // 0x61C(0xE)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B80[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Concave;                                           // 0x62C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_Shape                           Shape_Type;                                        // 0x630(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3B81[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Length_Curve_Segment;                              // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Dimension1;                                        // 0x640(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Dimension2;                                        // 0x644(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempDimension1;                                    // 0x648(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TempDimension2;                                    // 0x64C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CircleSegmentation;                                // 0x650(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AB_BackgroundProceduralBuilding_C* GetDefaultObj();

