#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xE (0xE - 0x0)
// UserDefinedStruct ST_RandomOptions.ST_RandomOptions
struct FST_RandomOptions
{
public:
	bool                                         FacadeMaterial_1_0767B031405F9366DCC91ABA827453FE; // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         GroundFloorMaterial_4_78B6A6FA4E2ACD66141B1BADD3DE2DBF; // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OrnamentsType_5_F43229E34D327846FBA9B4B1022EB176;  // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RoofMaterial_10_02B67E5949FFBEABFF7EEE8255FDD620;  // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RoofDimensions_11_B5ACE26C4B521C6C0D294290DDBF1BD5; // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NumberOfFloors_12_8201F74E4DA3CA4D18D4F19EA32A315B; // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3359[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxNumberFloors_15_2B5B683C476B6C5CE89EFA930AA0A0BF; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UsePresets_17_C0AE73B24455356E0B1362BE7BB64EB9;    // 0xC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OnlyOneTypeSections_19_E8C562D3406EA9BD4ED9D0AE99CCB7D3; // 0xD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


