#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x168 (0x578 - 0x410)
// WidgetBlueprintGeneratedClass W_Options_GamepadOptions_UE5.W_Options_GamepadOptions_UE5_C
class UW_Options_GamepadOptions_UE5_C : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x410(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_StandardSlider_C*                   Controls_Gamepad_AimSensitivityHorizontal;         // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_AimSensitivityVert;               // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_GyroHorizontalADSSensitivity;     // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_GyroHorizontalLookSensitivity;    // 0x430(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_GyroVertADSSensitivity;           // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_GyroVertLookSensitivity;          // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_LookInnerDeadzone;                // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_LookSensitivityHorizontal;        // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_LookSensitivitySpeedUp;           // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_LookSensitivityVert;              // 0x460(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Controls_Gamepad_MovementInnerDeadzone;            // 0x468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_DirectionalFaceButton;              // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_HoldCrouch;                         // 0x478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_InvertHorizontal;                   // 0x480(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_InvertHorizontalGyro;               // 0x488(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_InvertVertGyro;                     // 0x490(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_InvertVertical;                     // 0x498(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_StickLayout;                        // 0x4A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_ToggleADS;                          // 0x4A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_TogglePS5AdaptiveTrigger;           // 0x4B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_TogglePS5ADSAdaptiveTrigger;        // 0x4B8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_TogglePS5Gyro;                      // 0x4C0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_OnOff_Triggers;                           // 0x4C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Controls_Toggle_RadialNavigation;                  // 0x4D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      ForceFeedbackButton;                               // 0x4D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*             ForceFeedbackContainer;                            // 0x4E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   ForceFeedbackSlider;                               // 0x4E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Gamepad_Volume_Slider;                             // 0x4F0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                   InputMethodListener;                               // 0x4F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Options_AimAssistIntensity;                        // 0x500(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Options_GyroActiveMode;                            // 0x508(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            Tab_Gamepad;                                       // 0x510(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OptionsContainer_UE5_C*             W_OptionsContainer_UE5;                            // 0x518(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         Initialized;                                       // 0x520(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bShouldUpdateState;                                // 0x521(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_342B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<double, class FString>                  ForceFeedbackIntensityMap_0;                       // 0x528(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UW_Options_GamepadOptions_UE5_C* GetDefaultObj();

	class UWidget* BP_GetDesiredFocusTarget();
	void PopulateGamepadControls_0(bool CallFunc_GetForceFeedbackEnabled_ForceFeedbackEnabled, bool CallFunc_GetForceFeedbackEnabled_ReturnValue, bool CallFunc_GetGamepadRadialMenuUseLeftStick_UseLeftStick, bool CallFunc_GetGamepadRadialMenuUseLeftStick_ReturnValue, bool CallFunc_LoadPS5AdaptiveAimTriggers_PS5AdaptiveAimTriggers, bool CallFunc_LoadPS5AdaptiveAimTriggers_ReturnValue, bool CallFunc_LoadPS5AdaptiveFireTriggers_PS5AdaptiveFireTriggers, bool CallFunc_LoadPS5AdaptiveFireTriggers_ReturnValue, const class FString& CallFunc_GetGyroActiveMode_GyroActiveMode, bool CallFunc_GetGyroActiveMode_ReturnValue, bool CallFunc_GetGyroInverted_bInvertGyroVertical, bool CallFunc_GetGyroInverted_bInvertGyroHorizontal, bool CallFunc_GetGyroInverted_ReturnValue, bool CallFunc_SetActiveByString_Success, float CallFunc_GetGyroHorizontalAimSensitivity_GyroHorizontalAimSensitivity, bool CallFunc_GetGyroHorizontalAimSensitivity_ReturnValue, float CallFunc_GetGyroVerticalAimSensitivity_GyroVerticalAimSensitivity, bool CallFunc_GetGyroVerticalAimSensitivity_ReturnValue, double CallFunc_SetFloatValue_NewValue, double CallFunc_SetFloatValue_NewValue_1, float CallFunc_GetGyroHorizontalLookSensitivity_GyroHorizontalLookSensitivity, bool CallFunc_GetGyroHorizontalLookSensitivity_ReturnValue, float CallFunc_GetGyroVerticalLookSensitivity_GyroVerticalLookSensitivity, bool CallFunc_GetGyroVerticalLookSensitivity_ReturnValue, double CallFunc_SetFloatValue_NewValue_2, double CallFunc_SetFloatValue_NewValue_3, float CallFunc_GetGamepadLookSensitivitySpeedUp_GamepadLookSensitivitySpeedUp, bool CallFunc_GetGamepadLookSensitivitySpeedUp_ReturnValue, double CallFunc_SetFloatValue_NewValue_4, bool CallFunc_GetGamepadInvertButtonLayout_bInvertButtonLayout, bool CallFunc_GetGamepadInvertButtonLayout_ReturnValue, bool CallFunc_GetGamepadInvertStickLayout_bInvertStickLayout, bool CallFunc_GetGamepadInvertStickLayout_ReturnValue, float CallFunc_GetGamepadLookInnerDeadzone_GamepadLookInnerDeadzone, bool CallFunc_GetGamepadLookInnerDeadzone_ReturnValue, float CallFunc_GetGamepadMovementInnerDeadzone_GamepadMovementInnerDeadzone, bool CallFunc_GetGamepadMovementInnerDeadzone_ReturnValue, double CallFunc_SetFloatValue_NewValue_5, double CallFunc_SetFloatValue_NewValue_6, float CallFunc_GetGamepadAimSensitivityHorizontal_GamepadAimSensitivityHorizontal, bool CallFunc_GetGamepadAimSensitivityHorizontal_ReturnValue, float CallFunc_GetGamepadAimSensitivityVertical_GamepadAimSensitivityVertical, bool CallFunc_GetGamepadAimSensitivityVertical_ReturnValue, double CallFunc_SetFloatValue_NewValue_7, float CallFunc_GetGamepadLookSensitivityHorizontal_GamepadLookSensitivityHorizontal, bool CallFunc_GetGamepadLookSensitivityHorizontal_ReturnValue, float CallFunc_GetGamepadLookSensitivityVertical_GamepadLookSensitivityVertical, bool CallFunc_GetGamepadLookSensitivityVertical_ReturnValue, double CallFunc_SetFloatValue_NewValue_8, const class FString& CallFunc_GetGamepadAimAssistIntensity_AimAssistIntensity, bool CallFunc_GetGamepadAimAssistIntensity_ReturnValue, bool CallFunc_SetActiveByString_Success_1, float CallFunc_GetForceFeedbackIntensity_ForceFeedbackIntensity, bool CallFunc_GetForceFeedbackIntensity_ReturnValue, double CallFunc_SetFloatValue_NewValue_9, float CallFunc_GetSpeakerIntensity_SpeakerIntensity, bool CallFunc_GetSpeakerIntensity_ReturnValue, bool CallFunc_GetGamepadInvertTriggersLayout_bInvertTriggersLayout, bool CallFunc_GetGamepadInvertTriggersLayout_ReturnValue, double CallFunc_SetFloatValue_NewValue_10, bool CallFunc_LoadTogglePS5Gyro_TogglePS5Gyro, bool CallFunc_LoadTogglePS5Gyro_ReturnValue, bool CallFunc_LoadHoldCrouch_HoldCrouch, bool CallFunc_LoadHoldCrouch_ReturnValue, bool CallFunc_GetGamepadInverted_bInvertVertical, bool CallFunc_GetGamepadInverted_bInvertHorizontal, bool CallFunc_GetGamepadInverted_ReturnValue, bool CallFunc_LoadToggleADS_ToggleADS, bool CallFunc_LoadToggleADS_ReturnValue, double CallFunc_SetFloatValue_NewValue_11, double CallFunc_SetFloatValue_NewValue_12, double CallFunc_SetFloatValue_NewFloat_ImplicitCast, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_1, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_2, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_3, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_4, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_5, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_6, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_7, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_8, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_9, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_10, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_11, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_12);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_ToggleADS_K2Node_ComponentBoundEvent_72_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_HoldCrouch_K2Node_ComponentBoundEvent_73_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_LookSensitivity_K2Node_ComponentBoundEvent_85_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Controls_Gamepad_AimSensitivity_K2Node_ComponentBoundEvent_88_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_TogglePS5Gyro_K2Node_ComponentBoundEvent_59_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_W_CommonCarousel_K2Node_ComponentBoundEvent_61_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void BP_OnActivated();
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertHorizontal_K2Node_ComponentBoundEvent_71_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BP_OnDeactivated();
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_DirectionalFaceButton_K2Node_ComponentBoundEvent_2_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_StickLayout_K2Node_ComponentBoundEvent_3_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5AdaptiveTrigger_K2Node_ComponentBoundEvent_4_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Options_GyroActiveMode_K2Node_ComponentBoundEvent_5_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_K2Node_ComponentBoundEvent_6_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertLookSensitivity_1_K2Node_ComponentBoundEvent_7_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroVertADSSensitivity_K2Node_ComponentBoundEvent_8_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_GyroHorizontalADSSensitivity_K2Node_ComponentBoundEvent_9_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertVertGyro_K2Node_ComponentBoundEvent_10_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_InvertHorizontalGyro_K2Node_ComponentBoundEvent_11_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Controls_OnOff_InvertVertical_K2Node_ComponentBoundEvent_70_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivityHorizontal_K2Node_ComponentBoundEvent_12_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_AimSensitivityHorizontal_K2Node_ComponentBoundEvent_13_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookSensitivitySpeedUp_K2Node_ComponentBoundEvent_14_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_MovementInnerDeadzone_K2Node_ComponentBoundEvent_18_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_InputMethodListener_K2Node_ComponentBoundEvent_20_OnInputMethodChanged__DelegateSignature(bool bUsingGamepad);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_LookInnerDeadzone_K2Node_ComponentBoundEvent_22_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void ResetDefaultsGamepad();
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_TogglePS5ADSAdaptiveTrigger_K2Node_ComponentBoundEvent_19_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_W_OnOffButton_K2Node_ComponentBoundEvent_1_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_ForceFeedbackSlider_K2Node_ComponentBoundEvent_16_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_Triggers_K2Node_ComponentBoundEvent_17_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_OnOff_RadialMenu_1_K2Node_ComponentBoundEvent_21_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void UpdateDescriptions();
	void BndEvt__W_Options_GamepadOptions_UE5_Controls_Gamepad_Volume_K2Node_ComponentBoundEvent_0_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void ExecuteUbergraph_W_Options_GamepadOptions_UE5(int32 EntryPoint, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue, bool CallFunc_GetGamepadInverted_bInvertVertical, bool CallFunc_GetGamepadInverted_bInvertHorizontal, bool CallFunc_GetGamepadInverted_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_12, double K2Node_ComponentBoundEvent_NewSliderValue_12, double K2Node_ComponentBoundEvent_NewFloatValue_11, double K2Node_ComponentBoundEvent_NewSliderValue_11, bool CallFunc_SetGamepadLookSensitivityVertical_ReturnValue, bool CallFunc_SetGamepadAimSensitivityVertical_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_11, int32 K2Node_ComponentBoundEvent_Index_1, const class FString& K2Node_ComponentBoundEvent_Value_1, bool CallFunc_SaveTogglePS5Gyro_ReturnValue, bool CallFunc_SetGamepadAimAssistIntensity_ReturnValue, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue_1, bool K2Node_ComponentBoundEvent_bNewCheckState_10, bool CallFunc_SetGamepadInverted_ReturnValue, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue_2, bool K2Node_ComponentBoundEvent_bNewCheckState_9, bool CallFunc_SetGamepadInvertButtonLayout_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_8, bool CallFunc_SetGamepadInvertStickLayout_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_7, bool CallFunc_SavePS5AdaptiveFireTriggers_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 K2Node_ComponentBoundEvent_Index, const class FString& K2Node_ComponentBoundEvent_Value, double K2Node_ComponentBoundEvent_NewFloatValue_10, double K2Node_ComponentBoundEvent_NewSliderValue_10, bool CallFunc_SetGyroActiveMode_ReturnValue, bool CallFunc_SetGyroVerticalLookSensitivity_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_9, double K2Node_ComponentBoundEvent_NewSliderValue_9, double K2Node_ComponentBoundEvent_NewFloatValue_8, double K2Node_ComponentBoundEvent_NewSliderValue_8, bool CallFunc_SetGyroHorizontalLookSensitivity_ReturnValue, bool CallFunc_SetGyroVerticalAimSensitivity_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_7, double K2Node_ComponentBoundEvent_NewSliderValue_7, bool K2Node_ComponentBoundEvent_bNewCheckState_6, bool CallFunc_SetGyroHorizontalAimSensitivity_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_5, bool K2Node_ComponentBoundEvent_bNewCheckState_4, bool CallFunc_SetGamepadInverted_ReturnValue_1, double K2Node_ComponentBoundEvent_NewFloatValue_6, double K2Node_ComponentBoundEvent_NewSliderValue_6, double K2Node_ComponentBoundEvent_NewFloatValue_5, double K2Node_ComponentBoundEvent_NewSliderValue_5, bool CallFunc_SetGamepadLookSensitivityHorizontal_ReturnValue, bool CallFunc_SetGamepadAimSensitivityHorizontal_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_4, double K2Node_ComponentBoundEvent_NewSliderValue_4, double K2Node_ComponentBoundEvent_NewFloatValue_3, double K2Node_ComponentBoundEvent_NewSliderValue_3, bool CallFunc_SetGamepadLookSensitivitySpeedUp_ReturnValue, bool CallFunc_SetGamepadMovementInnerDeadzone_ReturnValue, bool K2Node_ComponentBoundEvent_bUsingGamepad, double K2Node_ComponentBoundEvent_NewFloatValue_2, double K2Node_ComponentBoundEvent_NewSliderValue_2, bool CallFunc_SetGamepadLookInnerDeadzone_ReturnValue, bool CallFunc_GetGyroInverted_bInvertGyroVertical, bool CallFunc_GetGyroInverted_bInvertGyroHorizontal, bool CallFunc_GetGyroInverted_ReturnValue, bool CallFunc_SetGyroInverted_ReturnValue, bool CallFunc_SetGyroInverted_ReturnValue_1, class UReadyOrNotGameUserSettings* CallFunc_GetReadyOrNotGameUserSettings_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_3, bool CallFunc_SavePS5AdaptiveAimTriggers_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool K2Node_ComponentBoundEvent_bNewCheckState_2, bool CallFunc_SetForceFeedbackEnabled_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState_12, bool K2Node_ComponentBoundEvent_bNewCheckState_13, bool CallFunc_SaveHoldCrouch_ReturnValue, bool CallFunc_SaveToggleADS_ReturnValue, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue_3, bool CallFunc_BooleanAND_ReturnValue_2, double K2Node_ComponentBoundEvent_NewFloatValue_1, double K2Node_ComponentBoundEvent_NewSliderValue_1, bool CallFunc_SetForceFeedbackIntensity_ReturnValue, class AReadyOrNotPlayerController* CallFunc_GetReadyOrNotPlayerController_ReturnValue_4, bool K2Node_ComponentBoundEvent_bNewCheckState_1, bool CallFunc_SetGamepadInvertTriggersLayout_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState, bool CallFunc_SetGamepadRadialMenuUseLeftStick_ReturnValue, bool CallFunc_SetGamepadSwitchBumpersTriggersLayout_ReturnValue, bool CallFunc_SetGamepadSwitchBumpersTriggersLayout_ReturnValue_1, bool CallFunc_GetGamepadInvertTriggersLayout_bInvertTriggersLayout, bool CallFunc_GetGamepadInvertTriggersLayout_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue, double K2Node_ComponentBoundEvent_NewSliderValue, const class FString& CallFunc_SelectString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, bool CallFunc_SetSpeakerIntensity_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const class FString& CallFunc_SelectString_ReturnValue_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Conv_StringToText_ReturnValue_1, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, float CallFunc_SetGamepadLookSensitivityVertical_GamepadLookSensitivityVertical_ImplicitCast, float CallFunc_SetGamepadAimSensitivityVertical_GamepadAimSensitivityVertical_ImplicitCast, float CallFunc_SetGyroVerticalLookSensitivity_GyroVerticalLookSensitivity_ImplicitCast, float CallFunc_SetGyroHorizontalLookSensitivity_GyroHorizontalLookSensitivity_ImplicitCast, float CallFunc_SetGyroVerticalAimSensitivity_GyroVerticalAimSensitivity_ImplicitCast, float CallFunc_SetGyroHorizontalAimSensitivity_GyroHorizontalAimSensitivity_ImplicitCast, float CallFunc_SetGamepadLookSensitivityHorizontal_GamepadLookSensitivityHorizontal_ImplicitCast, float CallFunc_SetGamepadAimSensitivityHorizontal_GamepadAimSensitivityHorizontal_ImplicitCast, float CallFunc_SetGamepadLookSensitivitySpeedUp_GamepadLookSensitivitySpeedUp_ImplicitCast, float CallFunc_SetGamepadMovementInnerDeadzone_GamepadMovementInnerDeadzone_ImplicitCast, float CallFunc_SetGamepadLookInnerDeadzone_GamepadLookInnerDeadzone_ImplicitCast, float CallFunc_SetForceFeedbackIntensity_ForceFeedbackIntensity_ImplicitCast, float CallFunc_SetForceFeedbackIntensity_ForceFeedbackIntensity_ImplicitCast_1, float CallFunc_SetSpeakerIntensity_SpeakerIntensity_ImplicitCast, float CallFunc_SetSpeakerIntensity_SpeakerIntensity_ImplicitCast_1);
};

}


