#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x81 (0x491 - 0x410)
// WidgetBlueprintGeneratedClass W_Options_Audio_UE5.W_Options_Audio_UE5_C
class UW_Options_Audio_UE5_C : public UCommonActivatableWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x410(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_CommonCarousel_C*                   Audio_AudioMix;                                    // 0x418(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Audio_DefaultVoipChannel;                          // 0x420(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Audio_InputAudioDevice;                            // 0x428(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_MasterVolume;                         // 0x430(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_MicGainVolume;                        // 0x438(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_MusicVolume;                          // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_SFXVolume;                            // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_SubtitlesBackgroundOpacity;           // 0x450(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_SubtitlesSpeed;                       // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_UIVolume;                             // 0x460(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_StandardSlider_C*                   Audio_Slider_VOIPVolume;                           // 0x468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_OnOffButton_C*                      Audio_SubtitlesEnabled;                            // 0x470(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Audio_SubtitlesLanguage;                           // 0x478(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_CommonCarousel_C*                   Audio_SubtitlesSize;                               // 0x480(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            Tab_Audio;                                         // 0x488(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         Initialized;                                       // 0x490(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_Options_Audio_UE5_C* GetDefaultObj();

	class UWidget* BP_GetDesiredFocusTarget();
	void PopulateSubtitleLocales(class UW_CommonCarousel_C* Carousel, TMap<class FString, class FText> CallFunc_GetAvailableLocales_ReturnValue, TArray<class FText>& CallFunc_Map_Values_Values, TArray<class FString>& CallFunc_Map_Keys_Keys, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void PopulateAudioSettings(TMap<class FString, class FText> AudioDevicesMap, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, enum class EAudioMixPreset CallFunc_GetAudioMixPreset_Preset, bool CallFunc_GetAudioMixPreset_ReturnValue, enum class EVoiceType CallFunc_GetVoiceType_OutVoiceType, bool CallFunc_GetVoiceType_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue, TArray<class FString>& CallFunc_Map_Keys_Keys, bool CallFunc_Map_IsEmpty_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_SetActiveByString_Success, const class FString& CallFunc_LoadSelectedAudioDevice_OutAudioDevice, bool CallFunc_LoadSelectedAudioDevice_ReturnValue, bool CallFunc_Map_Contains_ReturnValue, bool CallFunc_SetActiveByString_Success_1, TArray<class FText>& CallFunc_Map_Values_Values, TArray<class FString>& CallFunc_Map_Keys_Keys_1, enum class EVoiceType Temp_byte_Variable, int32 K2Node_Select_Default, bool CallFunc_IsPcPlatform_ReturnValue, const class FString& CallFunc_LoadSubtitlesLocale_SubtitlesLocale, bool CallFunc_LoadSubtitlesLocale_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, float CallFunc_LoadSubtitlesSpeed_SubtitlesSpeed, bool CallFunc_LoadSubtitlesSpeed_ReturnValue, double CallFunc_SetFloatValue_NewValue, float CallFunc_LoadSubtitlesBackgroundOpacity_SubtitlesBackgroundOpacity, bool CallFunc_LoadSubtitlesBackgroundOpacity_ReturnValue, double CallFunc_SetFloatValue_NewValue_1, enum class ESubtitlesSize CallFunc_LoadSubtitlesSize_SubtitlesSize, bool CallFunc_LoadSubtitlesSize_ReturnValue, bool CallFunc_LoadSubtitlesEnabled_bEnableSubtitles, bool CallFunc_LoadSubtitlesEnabled_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, float CallFunc_GetMicInputGain_MicInputGain, bool CallFunc_GetMicInputGain_ReturnValue, float CallFunc_GetVolumes_MasterVolume, float CallFunc_GetVolumes_UIVolume, float CallFunc_GetVolumes_SFXVolume, float CallFunc_GetVolumes_MusicVolume, float CallFunc_GetVolumes_VOIPVolume, bool CallFunc_GetVolumes_ReturnValue, class UReadyOrNotGameInstance* CallFunc_GetReadyOrNotGameInstance_ReturnValue, TArray<class FString>& CallFunc_GetAvailableAudioDevices_OutAudioDevices, bool CallFunc_GetAvailableAudioDevices_ReturnValue, double CallFunc_SetFloatValue_NewValue_2, bool CallFunc_BooleanAND_ReturnValue, const class FString& CallFunc_Array_Get_Item, class FText CallFunc_Conv_StringToText_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, double CallFunc_SetFloatValue_NewValue_3, double CallFunc_SetFloatValue_NewValue_4, double CallFunc_SetFloatValue_NewValue_5, double CallFunc_SetFloatValue_NewValue_6, double CallFunc_SetFloatValue_NewValue_7, double CallFunc_SetFloatValue_NewFloat_ImplicitCast, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_1, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_2, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_3, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_4, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_5, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_6, double CallFunc_SetFloatValue_NewFloat_ImplicitCast_7);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SFXVolume_1_K2Node_ComponentBoundEvent_29_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_UIVolume_1_K2Node_ComponentBoundEvent_31_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MusicVolume_1_K2Node_ComponentBoundEvent_32_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_VOIPVolume_1_K2Node_ComponentBoundEvent_37_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MasterVolume_1_K2Node_ComponentBoundEvent_25_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_MicGainVolume_1_K2Node_ComponentBoundEvent_40_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_SubtitlesEnabled_K2Node_ComponentBoundEvent_64_OnValueStateChange__DelegateSignature(bool bNewCheckState);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SubtitlesBackgroundOpacity_K2Node_ComponentBoundEvent_66_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BndEvt__W_SettingsMenuGamepad_Audio_Slider_SubtitlesSpeed_K2Node_ComponentBoundEvent_67_OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BndEvt__W_Options_Audio_UE5_Audio_SubtitlesSize_K2Node_ComponentBoundEvent_1_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_SubtitlesLanguage_K2Node_ComponentBoundEvent_2_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_InputAudioDevice_K2Node_ComponentBoundEvent_3_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void ResetDefaultAudio();
	void BndEvt__W_Options_Audio_UE5_Audio_DefaultVoipChannel_K2Node_ComponentBoundEvent_0_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void BndEvt__W_Options_Audio_UE5_Audio_AudioMix_K2Node_ComponentBoundEvent_4_OnPageIndexChanged__DelegateSignature(int32 Index, const class FString& Value);
	void ExecuteUbergraph_W_Options_Audio_UE5(int32 EntryPoint, int32 Temp_int_Variable, enum class EVoiceType Temp_byte_Variable, enum class EVoiceType Temp_byte_Variable_1, double K2Node_ComponentBoundEvent_NewFloatValue_7, double K2Node_ComponentBoundEvent_NewSliderValue_7, bool CallFunc_SaveSFXVolume_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_6, double K2Node_ComponentBoundEvent_NewSliderValue_6, bool CallFunc_SaveUIVolume_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_5, double K2Node_ComponentBoundEvent_NewSliderValue_5, bool CallFunc_SaveMusicVolume_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_4, double K2Node_ComponentBoundEvent_NewSliderValue_4, bool CallFunc_SaveVOIPVolume_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue_3, double K2Node_ComponentBoundEvent_NewSliderValue_3, double K2Node_ComponentBoundEvent_NewFloatValue_2, double K2Node_ComponentBoundEvent_NewSliderValue_2, bool CallFunc_SaveMasterVolume_ReturnValue, bool CallFunc_SetMicInputGain_ReturnValue, bool K2Node_ComponentBoundEvent_bNewCheckState, double K2Node_ComponentBoundEvent_NewFloatValue_1, double K2Node_ComponentBoundEvent_NewSliderValue_1, bool CallFunc_SaveSubtitlesEnabled_ReturnValue, bool CallFunc_SaveSubtitlesBackgroundOpacity_ReturnValue, double K2Node_ComponentBoundEvent_NewFloatValue, double K2Node_ComponentBoundEvent_NewSliderValue, bool CallFunc_SaveSubtitlesSpeed_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_4, const class FString& K2Node_ComponentBoundEvent_Value_4, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_3, const class FString& K2Node_ComponentBoundEvent_Value_3, bool CallFunc_SaveSubtitlesSize_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, bool CallFunc_SaveSubtitlesLocale_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_2, const class FString& K2Node_ComponentBoundEvent_Value_2, class UReadyOrNotGameInstance* CallFunc_GetReadyOrNotGameInstance_ReturnValue, bool CallFunc_SetInputAudioDevice_ReturnValue, class UReadyOrNotGameUserSettings* CallFunc_GetReadyOrNotGameUserSettings_ReturnValue, int32 K2Node_ComponentBoundEvent_Index_1, const class FString& K2Node_ComponentBoundEvent_Value_1, enum class EVoiceType K2Node_Select_Default, int32 K2Node_ComponentBoundEvent_Index, const class FString& K2Node_ComponentBoundEvent_Value, enum class EAudioMixPreset CallFunc_GetAudioMixPresetEnum_ReturnValue, bool CallFunc_SetAudioMixPreset_ReturnValue, float CallFunc_VCASetVolume_Volume_ImplicitCast, float CallFunc_SaveSFXVolume_Volume_ImplicitCast, float CallFunc_VCASetVolume_Volume_ImplicitCast_1, float CallFunc_SaveUIVolume_Volume_ImplicitCast, float CallFunc_VCASetVolume_Volume_ImplicitCast_2, float CallFunc_SaveMusicVolume_Volume_ImplicitCast, float CallFunc_SaveVOIPVolume_Volume_ImplicitCast, float CallFunc_VCASetVolume_Volume_ImplicitCast_3, float CallFunc_SaveMasterVolume_Volume_ImplicitCast, float CallFunc_SetMicInputGain_MicInputGain_ImplicitCast, float CallFunc_SaveSubtitlesBackgroundOpacity_SubtitlesBackgroundOpacity_ImplicitCast, float CallFunc_SaveSubtitlesSpeed_SubtitlesSpeed_ImplicitCast);
};

}


