#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x310 (0x810 - 0x500)
// WidgetBlueprintGeneratedClass W_Options_Controls_UE5.W_Options_Controls_UE5_C
class UW_Options_Controls_UE5_C : public USettingsMenuGamepad
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x500(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UW_ScrollButton_C*                     btn_ControlsEquipment;                             // 0x508(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsInteraction;                           // 0x510(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsMisc;                                  // 0x518(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsMovement;                              // 0x520(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsReplay;                                // 0x528(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsTeamwork;                              // 0x530(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_ScrollButton_C*                     btn_ControlsVehicle;                               // 0x538(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                   CommonActionWidget;                                // 0x540(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActionWidget*                   CommonActionWidget_147;                            // 0x548(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Equipment_Widget;                         // 0x550(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Interaction_Widget;                       // 0x558(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Miscellaneous_Widget;                     // 0x560(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Movement_Widget;                          // 0x568(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Movement_Widget_1;                        // 0x570(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Replay_Widget;                            // 0x578(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Teamwork_Widget;                          // 0x580(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            Controls_Vehicle_Widget;                           // 0x588(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       ControlsWidgetSwitcher;                            // 0x590(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        HB_ControlsCategoryTabs;                           // 0x598(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                           NextGamepadTabButton;                              // 0x5A0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Button_C*                           PreviousGamepadTabButton;                          // 0x5A8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            ScrollBox_4;                                       // 0x5B0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMargin                               BindNamePadding;                                   // 0x5B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                               Bind1Padding;                                      // 0x5C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                               Bind2Padding;                                      // 0x5D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FMargin                               BindResetPadding;                                  // 0x5E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UW_ControlsBind_C*                     Temp_FirstInput;                                   // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                     Temp_SecondInput;                                  // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                         IsAxis;                                            // 0x608(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_F63[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Conflicting_Bind_Format;                           // 0x610(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UW_ControlsBind_C*                     ConflictingBindPending;                            // 0x628(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_ControlsBind_C*                     ListeningBinding;                                  // 0x630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UW_BindConflictModal_C*                ConflictDetectedPopUp;                             // 0x638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FKeyBinding>                   Unbindable_Controls;                               // 0x640(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   MovementControls;                                  // 0x650(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   EquipmentControls;                                 // 0x660(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   InteractionControls;                               // 0x670(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   TeamworkControls;                                  // 0x680(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   MiscellaneousControls;                             // 0x690(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FKeyBinding>                   ReplayControls;                                    // 0x6A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UW_ScrollButton_C*                     ActiveControlTabButton;                            // 0x6B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FSStandardModalDetails                BindConflictModalDetails;                          // 0x6B8(0x79)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_F7C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSStandardModalDetails                IllegalKeyConflictModalDetails;                    // 0x738(0x79)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_FA4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UW_ScrollButton_C*, class UWidget*> ControlsCategoriesMap;                             // 0x7B8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UWidget*                               ActiveControlTab;                                  // 0x808(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_Options_Controls_UE5_C* GetDefaultObj();

	void PreviousControlsTab(TArray<class UW_ScrollButton_C*>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, class UW_ScrollButton_C* CallFunc_Array_Get_Item, class UW_ScrollButton_C* CallFunc_Array_Get_Item_1, class UWidget* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UWidget* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void NextControlsTab(TArray<class UW_ScrollButton_C*>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Find_ReturnValue, class UW_ScrollButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Add_IntInt_ReturnValue, class UWidget* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UW_ScrollButton_C* CallFunc_Array_Get_Item_1, class UWidget* CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool CallFunc_Array_IsValidIndex_ReturnValue);
	void SetupControlsCategories();
	class UWidget* BP_GetDesiredFocusTarget();
	void Initialise_Or_Get_Pop_Up(class UClass* PopUpType, const struct FSStandardModalDetails& ModalDetails, class UStandardModal** OutputPopUp, class UStandardModal* TempPopUp, class UClass* PopUpClass, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UStandardModal* CallFunc_Create_ReturnValue, TArray<class UStandardModal*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets, class UStandardModal* CallFunc_Array_Get_Item);
	void SwitchControlsTab(class UW_ScrollButton_C* Button, class UWidget* MenuWidget, TArray<class UW_ControlsResetBinding_C*>& CallFunc_WidgetGetChildrenOfClass_ChildWidgets, class UW_ControlsResetBinding_C* CallFunc_Array_Get_Item, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void Clear_Control_Binds_Lists();
	void PopulatePCControls();
	void GetConflictingKeybindText(const struct FKey& Key, TArray<struct FAxisMappingStruct>& ConflictingAxes, TArray<struct FActionMappingStruct>& ConflictingActions, TArray<class FText>& ConflictBindNames, class FText* Text, class FText CallFunc_GetConflictingKeybindListText_Text, const class FString& CallFunc_Abbreviate_Key_Abreviated_Name, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue);
	void GetConflictingKeybindListText(TArray<struct FAxisMappingStruct>& Axes, TArray<struct FActionMappingStruct>& Actions, TArray<class FText>& ConflictBinds, class FText* Text, class FText LocalizedActionChain, class FText Inputs_2LocalizedComma, class FText Inputs_2LocalizedAnd, const TArray<class FText>& LocalizedActions, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class FText CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, bool CallFunc_Less_IntInt_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, class FText CallFunc_Array_Get_Item_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, class FText CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_5, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_3);
	void TryAssignUnbindableControl(const struct FKeyBinding& KeyBinding, bool* bSuccess, bool CannotBeUnbindable, int32 CallFunc_Array_AddUnique_ReturnValue);
	void Add_To_Control_Binds_Lists(class UW_ControlsBind_C* ControlBind, const struct FAxisMappingStruct& InputAxis, const struct FActionMappingStruct& InputAction, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1);
	void Construct();
	void AddControlsToGridPanel(TArray<struct FKeyBinding>& Bindings, class UGridPanel* GridPanel);
	void On_Binding_Started(class UW_ControlsBind_C* CallingWidget);
	void On_Binding_Canceled(class UW_ControlsBind_C* CallingWidget);
	void On_Binding_Committed(class UW_ControlsBind_C* CallingWidget, const struct FKey& NewKey);
	void Conflicting_Bind_Detected(class UW_ControlsBind_C* CallingBind, TArray<struct FActionMappingStruct>& ActionMappings, TArray<struct FAxisMappingStruct>& AxisMappings, const struct FKey& Key, TArray<class FText>& ConflictBindsText);
	void End_Buttons_Disabled_For_Binding();
	void ResetKeybinds();
	void Conflicting_Bind_Ok_Clicked(class UW_StandardModal_C* CallingModal, class FText TextEntry);
	void Conflicting_Bind_Cancel_Clicked(class UStandardModal* CallingModal);
	void InitialisePopUps();
	void OnCancelIllegalBindClicked(class UStandardModal* CallingModal);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void BndEvt__W_Options_Controls_UE5_NextGamepadTabButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_Options_Controls_UE5_PreviousGamepadTabButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature(class UW_Button_C* Button);
	void BndEvt__W_Options_Controls_UE5_W_ScrollButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsVehicle_K2Node_ComponentBoundEvent_3_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsMovement_1_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsEquipment_1_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsInteraction_1_K2Node_ComponentBoundEvent_6_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void BndEvt__W_Options_Controls_UE5_btn_ControlsReplay_1_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature(class UW_ScrollButton_C* Button);
	void ExecuteUbergraph_W_Options_Controls_UE5(int32 EntryPoint, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, class UW_SettingLabel_C* CallFunc_Create_ReturnValue, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_4, TArray<struct FKeyBinding>& K2Node_CustomEvent_Bindings, class UGridPanel* K2Node_CustomEvent_GridPanel, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, const struct FKeyBinding& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_TryAssignUnbindableControl_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_TryAssignUnbindableControl_bSuccess_1, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable_4, int32 Temp_int_Array_Index_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_5, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class UW_ControlsBind_C* CallFunc_Create_ReturnValue_1, class UW_ControlsBind_C* CallFunc_Create_ReturnValue_2, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_1, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_6, int32 Temp_int_Array_Index_Variable_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class UW_ControlsBind_C* K2Node_CustomEvent_CallingWidget_2, TArray<class UW_StandardButton_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets, class UW_StandardButton_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, TArray<class UW_ControlsBind_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets_1, int32 CallFunc_Array_Length_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, TArray<class UW_ControlsResetBinding_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets_2, class UW_ControlsResetBinding_C* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1, class UW_ControlsResetBinding_C* CallFunc_Create_ReturnValue_3, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue_3, TArray<class UW_ControlsBind_C*>& K2Node_MakeArray_Array, TArray<struct FAxisMappingStruct>& K2Node_MakeArray_Array_1, TArray<struct FActionMappingStruct>& K2Node_MakeArray_Array_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, class UW_ControlsBind_C* K2Node_CustomEvent_CallingWidget_1, TArray<class UW_ControlsBind_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets_3, int32 Temp_int_Loop_Counter_Variable_6, class UW_ControlsBind_C* CallFunc_Array_Get_Item_3, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_7, int32 CallFunc_Array_Length_ReturnValue_4, TArray<class UW_ControlsResetBinding_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets_4, bool CallFunc_Less_IntInt_ReturnValue_3, class UW_ControlsResetBinding_C* CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_5, int32 Temp_int_Array_Index_Variable_7, bool CallFunc_Less_IntInt_ReturnValue_4, class UW_ControlsBind_C* CallFunc_Array_Get_Item_5, bool CallFunc_NotEqual_ObjectObject_ReturnValue, TArray<class UW_StandardButton_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets_5, class UW_StandardButton_C* CallFunc_Array_Get_Item_6, int32 CallFunc_Array_Length_ReturnValue_6, bool CallFunc_Less_IntInt_ReturnValue_5, class UW_ControlsBind_C* K2Node_CustomEvent_CallingWidget, const struct FKey& K2Node_CustomEvent_NewKey, class UW_ControlsBind_C* K2Node_CustomEvent_CallingBind, TArray<struct FActionMappingStruct>& K2Node_CustomEvent_ActionMappings, TArray<struct FAxisMappingStruct>& K2Node_CustomEvent_AxisMappings, const struct FKey& K2Node_CustomEvent_Key, TArray<class FText>& K2Node_CustomEvent_ConflictBindsText, class FText CallFunc_GetConflictingKeybindText_Text, class UReadyOrNotGameUserSettings* CallFunc_GetReadyOrNotGameUserSettings_ReturnValue, class UInputSettings* CallFunc_GetInputSettings_ReturnValue, int32 Temp_int_Loop_Counter_Variable_7, bool CallFunc_Less_IntInt_ReturnValue_6, int32 CallFunc_Add_IntInt_ReturnValue_8, class UW_StandardModal_C* K2Node_CustomEvent_CallingModal_2, class FText K2Node_CustomEvent_TextEntry, class UStandardModal* K2Node_CustomEvent_CallingModal_1, class UStandardModal* CallFunc_Initialise_Or_Get_Pop_Up_OutputPopUp, class UStandardModal* CallFunc_Initialise_Or_Get_Pop_Up_OutputPopUp_1, class UW_BindConflictModal_C* K2Node_DynamicCast_AsW_Bind_Conflict_Modal, bool K2Node_DynamicCast_bSuccess, class UW_IllegalUnbindModal_C* K2Node_DynamicCast_AsW_Illegal_Unbind_Modal, bool K2Node_DynamicCast_bSuccess_1, class UStandardModal* K2Node_CustomEvent_CallingModal, TArray<class UW_ScrollButton_C*>& CallFunc_WidgetGetChildrenOfClass_ChildWidgets, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UW_ScrollButton_C* CallFunc_Array_Get_Item_7, class UWidget* CallFunc_Array_Get_Item_8, bool CallFunc_IsVisible_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_7, class UW_Button_C* K2Node_ComponentBoundEvent_Button_8, bool CallFunc_Less_IntInt_ReturnValue_7, class UW_Button_C* K2Node_ComponentBoundEvent_Button_7, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_6, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_5, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_4, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_3, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_2, class UW_ScrollButton_C* K2Node_ComponentBoundEvent_Button_1, double CallFunc_SetDoublePropertyByName_Value_ImplicitCast, double CallFunc_SetDoublePropertyByName_Value_ImplicitCast_1);
};

}


