#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x171 (0x431 - 0x2C0)
// WidgetBlueprintGeneratedClass W_StandardSlider.W_StandardSlider_C
class UW_StandardSlider_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                               HighlightButton;                                   // 0x2C8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                          ProgressBar_71;                                    // 0x2D0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_136;                                      // 0x2D8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            SliderValueText;                                   // 0x2E0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               TheSlider;                                         // 0x2E8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            DescriptionTextWidget;                             // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FText                                  Description;                                       // 0x2F8(0x18)(Edit, BlueprintVisible, ExposeOnSpawn)
	enum class EStandardSliderTypes              SliderType;                                        // 0x310(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_2FD6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SliderFloatMin;                                    // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        SliderIntegerMin;                                  // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        SliderIntegerMax;                                  // 0x324(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        SliderIntegerStep;                                 // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_2FD8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       SliderFloatMax;                                    // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       SliderFloatStep;                                   // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       PreviewFloatValue;                                 // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       FloatValue;                                        // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        IntegerValue;                                      // 0x350(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        QualityValue;                                      // 0x354(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PreviewIntegerValue;                               // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        PreviewQualityValue;                               // 0x35C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnFloatValueChanged;                               // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnIntegralValueChanged;                            // 0x370(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            OnQualityValueChanged;                             // 0x380(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bDisplayAsPercent;                                 // 0x390(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_2FF0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  PercentageFormat;                                  // 0x398(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FString>                        SupportedResolutions;                              // 0x3B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                ResolutionValue;                                   // 0x3C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnResolutionValueChanged;                          // 0x3D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         SnapToGrid;                                        // 0x3E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3010[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnDlssValueChanged;                                // 0x3E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       SliderTextSizeRatio;                               // 0x3F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         bCompatibility_WasUserInput;                       // 0x400(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3012[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Description_PS5Variant;                            // 0x408(0x18)(Edit, BlueprintVisible, ExposeOnSpawn)
	FMulticastInlineDelegateProperty_            OnUpdateSliderText;                                // 0x420(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bManualyUpdateText;                                // 0x430(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UW_StandardSlider_C* GetDefaultObj();

	void SetText(class FText InText);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FEventReply& CallFunc_Unhandled_ReturnValue, const struct FEventReply& CallFunc_Handled_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class UCommonInputSubsystem* CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue, enum class ECommonInputType CallFunc_GetCurrentInputType_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void SetupDescription(class UW_Options_UE5_C* CallFunc_FindParentWidgetOfType_ReturnValue);
	class UWidget* Navigate_Left(enum class EUINavigation Navigation, float CallFunc_GetValue_ReturnValue, double CallFunc_Subtract_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_Subtract_DoubleDouble_B_ImplicitCast, double CallFunc_Subtract_DoubleDouble_A_ImplicitCast, float CallFunc_SetValue_InValue_ImplicitCast);
	class UWidget* Navigate_Right(enum class EUINavigation Navigation, float CallFunc_GetValue_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_FClamp_ReturnValue, double CallFunc_Add_DoubleDouble_B_ImplicitCast, double CallFunc_Add_DoubleDouble_A_ImplicitCast, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetFrameGenerationValue(int32 NewQuality, int32 CallFunc_Clamp_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetFSRQualityValue(int32 NewQuality, int32 CallFunc_Clamp_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetDLSSQualityValue(int32 NewQuality, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue, int32 CallFunc_Clamp_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void AddIntegralValue(int32 Value, int32* NewValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_SetIntegralValue_NewValue);
	void AddFloatValue(double Value, double* NewValue, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_SetFloatValue_NewValue);
	void SetResolutionValue(const class FString& Resolution, class FText CallFunc_Conv_StringToText_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetQualityValue(int32 NewQuality, int32 CallFunc_Clamp_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetIntegralValue(int32 NewInteger, int32* NewValue, double CallFunc_Conv_IntToDouble_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, int32 CallFunc_Clamp_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_2, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void SetFloatValue(double NewFloat, double* NewValue, double CallFunc_FClamp_ReturnValue, double CallFunc_NormalizeToRange_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, float CallFunc_SetValue_InValue_ImplicitCast);
	void UpdateSliderText(int32 Temp_int_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, bool CallFunc_Not_PreBool_ReturnValue, class FText K2Node_Select_Default, float CallFunc_GetNormalizedValue_ReturnValue, class FText CallFunc_GenerateFSRQualityString_ReturnValue, class FText CallFunc_GenerateDlssQualityString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue, class FText CallFunc_Conv_DoubleToText_ReturnValue, int32 CallFunc_Round_ReturnValue, int64 CallFunc_Conv_IntToInt64_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_IntToText_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText CallFunc_GenerateQualityString_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__TheSlider_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__TheSlider_K2Node_ComponentBoundEvent_1_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__TheSlider_K2Node_ComponentBoundEvent_2_OnMouseCaptureEndEvent__DelegateSignature();
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void ExecuteUbergraph_W_StandardSlider(int32 EntryPoint, double CallFunc_Conv_IntToDouble_ReturnValue, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_1, double CallFunc_Conv_IntToDouble_ReturnValue_2, double CallFunc_Conv_IntToDouble_ReturnValue_3, double CallFunc_Conv_IntToDouble_ReturnValue_4, double CallFunc_Conv_IntToDouble_ReturnValue_5, double CallFunc_NormalizeToRange_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_6, double CallFunc_NormalizeToRange_ReturnValue_1, const class FString& CallFunc_Array_Get_Item, double CallFunc_Conv_IntToDouble_ReturnValue_7, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool K2Node_Event_IsDesignTime, double CallFunc_Conv_IntToDouble_ReturnValue_8, double CallFunc_NormalizeToRange_ReturnValue_2, bool K2Node_SwitchEnum_CmpSuccess, double CallFunc_SetFloatValue_NewValue, int32 CallFunc_SetIntegralValue_NewValue, float K2Node_ComponentBoundEvent_Value, bool K2Node_SwitchEnum_CmpSuccess_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, int32 CallFunc_Round_ReturnValue, int32 CallFunc_Round_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_2, int32 CallFunc_Clamp_ReturnValue, int32 CallFunc_Round_ReturnValue_2, int32 CallFunc_Clamp_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue_3, int32 CallFunc_Round_ReturnValue_3, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue_2, int32 CallFunc_Clamp_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32 CallFunc_Clamp_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_3, double CallFunc_Multiply_IntFloat_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_9, int32 CallFunc_Round_ReturnValue_4, int32 CallFunc_Clamp_ReturnValue_4, TArray<class FString>& CallFunc_GetSupportedScreenResolutions_Resolutions, bool CallFunc_GetSupportedScreenResolutions_ReturnValue, const class FString& CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_GetNormalizedValue_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_4, double CallFunc_Conv_IntToDouble_ReturnValue_10, double CallFunc_Divide_DoubleDouble_ReturnValue, double CallFunc_GridSnap_Float_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_1, double CallFunc_GridSnap_Float_ReturnValue_1, double CallFunc_Divide_DoubleDouble_ReturnValue_2, double CallFunc_GridSnap_Float_ReturnValue_2, const struct FSlateChildSize& K2Node_MakeStruct_SlateChildSize, class UHorizontalBoxSlot* K2Node_DynamicCast_AsHorizontal_Box_Slot, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue_2, double CallFunc_Conv_IntToDouble_ReturnValue_11, int32 CallFunc_Subtract_IntInt_ReturnValue_5, double CallFunc_Conv_IntToDouble_ReturnValue_12, double CallFunc_NormalizeToRange_ReturnValue_3, double CallFunc_Divide_DoubleDouble_ReturnValue_3, double CallFunc_GridSnap_Float_ReturnValue_3, double CallFunc_Conv_IntToDouble_ReturnValue_13, double CallFunc_NormalizeToRange_ReturnValue_4, double CallFunc_Conv_IntToDouble_ReturnValue_14, int32 CallFunc_GetNumDlssQualityOptions_ReturnValue_3, double CallFunc_Subtract_DoubleDouble_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_6, double CallFunc_Multiply_DoubleDouble_ReturnValue_4, double CallFunc_Conv_IntToDouble_ReturnValue_15, double CallFunc_Add_DoubleDouble_ReturnValue, double CallFunc_Divide_DoubleDouble_ReturnValue_4, double CallFunc_FClamp_ReturnValue, double CallFunc_GridSnap_Float_ReturnValue_4, float CallFunc_GetValue_ReturnValue, double CallFunc_Add_DoubleDouble_ReturnValue_1, double CallFunc_NormalizeToRange_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue, double CallFunc_Conv_IntToDouble_ReturnValue_16, int32 CallFunc_Subtract_IntInt_ReturnValue_7, double CallFunc_NormalizeToRange_ReturnValue_6, double CallFunc_Conv_IntToDouble_ReturnValue_17, double CallFunc_Multiply_DoubleDouble_ReturnValue_5, const struct FGeometry& K2Node_Event_MyGeometry, const struct FPointerEvent& K2Node_Event_MouseEvent_1, double CallFunc_Add_DoubleDouble_ReturnValue_2, const struct FPointerEvent& K2Node_Event_MouseEvent, int32 CallFunc_Round_ReturnValue_5, int32 CallFunc_Clamp_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_1, enum class EGamePlatform CallFunc_GetPlatform_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_TextIsNotEmpty_NotEmpty, bool CallFunc_BooleanAND_ReturnValue, float CallFunc_SetStepSize_InValue_ImplicitCast, float CallFunc_SetStepSize_InValue_ImplicitCast_1, float CallFunc_SetStepSize_InValue_ImplicitCast_2, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2, double CallFunc_Multiply_IntFloat_B_ImplicitCast, double CallFunc_GridSnap_Float_Location_ImplicitCast, double CallFunc_GridSnap_Float_Location_ImplicitCast_1, double CallFunc_GridSnap_Float_Location_ImplicitCast_2, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4, double CallFunc_Multiply_DoubleDouble_A_ImplicitCast_5, double CallFunc_GridSnap_Float_Location_ImplicitCast_3, double K2Node_CallDelegate_NewSliderValue_ImplicitCast, double K2Node_CallDelegate_NewSliderValue_ImplicitCast_1, double K2Node_CallDelegate_NewSliderValue_ImplicitCast_2, double K2Node_CallDelegate_NewSliderValue_ImplicitCast_3, double CallFunc_GridSnap_Float_Location_ImplicitCast_4, float CallFunc_SetValue_InValue_ImplicitCast, float CallFunc_SetValue_InValue_ImplicitCast_1, float CallFunc_SetValue_InValue_ImplicitCast_2, float K2Node_MakeStruct_Value_ImplicitCast, float CallFunc_SetStepSize_InValue_ImplicitCast_3, float CallFunc_SetValue_InValue_ImplicitCast_3, float CallFunc_SetStepSize_InValue_ImplicitCast_4, float CallFunc_SetValue_InValue_ImplicitCast_4, float CallFunc_SetStepSize_InValue_ImplicitCast_5, float CallFunc_SetStepSize_InValue_ImplicitCast_6);
	void OnUpdateSliderText__DelegateSignature();
	void OnDlssValueChanged__DelegateSignature(int32 NewIntegerValue, double NewSliderValue);
	void OnResolutionValueChanged__DelegateSignature(const class FString& NewResolutionValue, double NewSliderValue);
	void OnQualityValueChanged__DelegateSignature(int32 NewQualityValue, double NewSliderValue);
	void OnIntegralValueChanged__DelegateSignature(int32 NewIntegerValue, double NewSliderValue);
	void OnFloatValueChanged__DelegateSignature(double NewFloatValue, double NewSliderValue);
};

}


